Revit 2027 API
BuiltInFailures.CurtainWallFailures.CannotApplyGridSpecification Property
 It is not possible to apply the host family's grid specification to this instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotApplyGridSpecification { get; }
Public Shared ReadOnly Property CannotApplyGridSpecification As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotApplyGridSpecification {
	FailureDefinitionId^ get ();
}
static member CannotApplyGridSpecification : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace